###Data Aggregation

Categorizing a data set and applying a function to each group, whether an aggregation or transformation, is often a critical component of a data analysis workflow. After loading, merging, and preparing a data set, a familiar task is to compute group statistics or possibly pivot tables for reporting or visualization purposes. pandas provides a flexible and high-performance groupby facility.
Hadley Wickham, an author of many popular packages for the R programming language, coined the term split-apply-combine for talking about group operations.
The splitting is performed on a particular axis of an object. For example, a DataFrame can be grouped on its rows ( axis=0 ) or its columns ( axis=1 ). Once this is done, a function is applied to each group, producing a new value. Finally, the results of all those function applications are combined into a result object.

In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [3]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0 -0.184615  1.167716    a  one
1  0.921519 -0.255309    a  two
2 -2.569943  1.383041    b  one
3  1.300969  0.384002    b  two
4 -0.648981 -2.199104    a  one

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

This grouped variable is now a GroupBy object. It has not actually computed anything yet except for some intermediate data about the group key df['key1'] . The idea is that this object has all of the information needed to then apply some operation to each of the groups.

In [8]:
grouped.mean()

key1
a       0.029308
b      -0.634487
Name: data1, dtype: float64

The important thing here is that the data (a Series) has been aggregated according to the group key, producing a new Series that is now indexed by the unique values in the key1 column.The result index has the name 'key1' because the DataFrame column df['key1'] did.

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.416798
      two     0.921519
b     one    -2.569943
      two     1.300969
Name: data1, dtype: float64

In these examples, the group keys are all Series, though they could be any arrays of the right length:

In [11]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [12]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states, years]).mean()

California  2005    0.921519
            2006   -2.569943
Ohio        2005    0.558177
            2006   -0.648981
Name: data1, dtype: float64

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.029308 -0.428899
b    -0.634487  0.883522

In [15]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.416798 -0.515694
     two   0.921519 -0.255309
b    one  -2.569943  1.383041
     two   1.300969  0.384002

You may have noticed in the first case df.groupby('key1').mean() that there is no key2 column in the result. Because df['key2'] is not numeric data, it is said to be a nuisance column, which is therefore excluded from the result.

In [16]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

###Iterating Over Groups

The GroupBy object supports iteration, generating a sequence of 2-tuples containing the group name along with the chunk of data.

In [18]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.184615  1.167716    a  one
1  0.921519 -0.255309    a  two
4 -0.648981 -2.199104    a  one
b
      data1     data2 key1 key2
2 -2.569943  1.383041    b  one
3  1.300969  0.384002    b  two

In the case of multiple keys, the first element in the tuple will be a tuple of key values

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.184615  1.167716    a  one
4 -0.648981 -2.199104    a  one
a two
      data1     data2 key1 key2
1  0.921519 -0.255309    a  two
b one
      data1     data2 key1 key2
2 -2.569943  1.383041    b  one
b two
      data1     data2 key1 key2
3  1.300969  0.384002    b  two

You can create a dict of the data pieces as a one-liner

In [20]:
pieces = dict(list(df.groupby('key1')))

In [21]:
pieces['b']

      data1     data2 key1 key2
2 -2.569943  1.383041    b  one
3  1.300969  0.384002    b  two

In [22]:
df

      data1     data2 key1 key2
0 -0.184615  1.167716    a  one
1  0.921519 -0.255309    a  two
2 -2.569943  1.383041    b  one
3  1.300969  0.384002    b  two
4 -0.648981 -2.199104    a  one

Indexing a GroupBy object created from a DataFrame with a column name or array of column names has the effect of selecting those columns for aggregation

In [32]:
df.groupby('key1')['data1'].mean()

key1
a       0.029308
b      -0.634487
Name: data1, dtype: float64

In [33]:
df.groupby('key1')[['data1']].mean()

         data1
key1
a     0.029308
b    -0.634487

In [35]:
df[['data1']].groupby(df['key1']).mean()

         data1
key1
a     0.029308
b    -0.634487

In [36]:
df['data1'].groupby(df['key1']).mean()

key1
a       0.029308
b      -0.634487
Name: data1, dtype: float64

###Grouping with Dicts and Series

In [37]:
people = DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [38]:
people.ix[2:3, ['b', 'c']] = np.nan

In [39]:
people

               a         b         c         d         e
Joe    -0.089753  1.619988 -1.028283  0.422741  0.238460
Steve   0.951805  0.575729  0.159734 -2.624750  0.969184
Wes    -0.642609       NaN       NaN -0.175658  0.183310
Jim    -0.825652  1.044280  1.519491  0.208890 -0.008252
Travis  0.238810 -0.396371 -0.960940  0.684395  1.056710

Now, suppose I have a group correspondence for the columns and want to sum together the columns by group:

In [40]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue','d': 'blue', 'e': 'red', 'f' : 'orange'}

In [41]:
by_column = people.groupby(mapping, axis=1)

In [42]:
by_column.sum()

            blue       red
Joe    -0.605543  1.768695
Steve  -2.465016  2.496718
Wes    -0.175658 -0.459299
Jim     1.728381  0.210377
Travis -0.276545  0.899149

The same functionality holds for Series, which can be viewed as a fixed size mapping.

In [44]:
map_series = Series(mapping)

In [45]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [46]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

###Grouping with Functions

Using Python functions in what can be fairly creative ways is a more abstract way of defining a group mapping compared with a dict or Series. Any function passed as a group key will be called once per index value, with the return values being used as the group names.

In [47]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.558013  2.664268  0.491207  0.455973  0.413518
5  0.951805  0.575729  0.159734 -2.624750  0.969184
6  0.238810 -0.396371 -0.960940  0.684395  1.056710

Mixing functions with arrays, dicts, or Series is not a problem as everything gets converted to arrays internally:

In [48]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [49]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.642609  1.619988 -1.028283 -0.175658  0.183310
  two -0.825652  1.044280  1.519491  0.208890 -0.008252
5 one  0.951805  0.575729  0.159734 -2.624750  0.969184
6 two  0.238810 -0.396371 -0.960940  0.684395  1.056710

###Data Aggregation

You are not limited to only this set of methods. You can use aggregations of your devising and additionally call any method that is also defined on the grouped object.

In [51]:
df.groupby('key1').quantile(0.9)

         data1     data2
key1
a     0.700293  0.883111
b     0.913878  1.283137

While quantile is not explicitly implemented for GroupBy, it is a Series method and thus available for use. Internally, GroupBy efficiently slices up the Series, calls piece.quantile(0.9) for each piece, then assembles those results together into the result
object.

In [52]:
grouped = df.groupby('key1')

To use your own aggregation functions, pass any function that aggregates an array to the aggregate or agg method:

In [53]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [54]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.570500  3.366820
b     3.870913  0.999039

methods like describe also work,

In [56]:
grouped.describe()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   0.029308 -0.428899
     std    0.806808  1.690109
     min   -0.648981 -2.199104
     25%   -0.416798 -1.227206
     50%   -0.184615 -0.255309
     75%    0.368452  0.456204
     max    0.921519  1.167716
b    count  2.000000  2.000000
     mean  -0.634487  0.883522
     std    2.737149  0.706427
     min   -2.569943  0.384002
     25%   -1.602215  0.633762
     50%   -0.634487  0.883522
     75%    0.333241  1.133281
     max    1.300969  1.383041

you may want to aggregate using a different function depending on the column or multiple functions at once.

In [57]:
tips = pd.read_csv('../../../data/tips.csv')

In [59]:
tips[:6]

   total_bill     tip sex smoker  day    time  size  tip_pct
0        22.0   1.232   F     No  Sun  Dinner     2    0.056
1        21.3   3.408   M     No  Sun  Dinner     3    0.160
2        12.0   1.680   M     No  Sun  Dinner     1    0.140
3        67.0  11.390   M     No  Sun  Dinner     4    0.170
4        11.0   1.078   F     No  Sun  Dinner     3    0.098
5        22.0   2.464   M     No  Sun  Dinner     4    0.112

In [60]:
grouped = tips.groupby(['sex', 'smoker'])

In [61]:
grouped_pct = grouped['tip_pct']

In [62]:
grouped_pct.agg('mean')

sex  smoker
F    No        0.077000
     Yes       0.116667
M    No        0.145500
     Yes       0.176750
Name: tip_pct, dtype: float64

In [63]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                mean       std  peak_to_peak
sex smoker
F   No      0.077000  0.029698         0.042
    Yes     0.116667  0.011547         0.020
M   No      0.145500  0.025580         0.058
    Yes     0.176750  0.043805         0.105